In [1]:
import sqlite3

conn = sqlite3.connect('test.db')

print("Opened database successfully")

Opened database successfully

In [2]:


import sqlite3

 
conn = sqlite3.connect('NeDB.db')
 
cursor = conn.cursor()


cursor.execute("DROP TABLE IF EXISTS EMPLOYEE")

X= '''CREATE TABLE IF NOT EXISTS projects (
	id integer PRIMARY KEY,
	name text NOT NULL,
	begin_date text,
	end_date text
); '''
conn.execute(X)
print("Table created")
 
conn.commit()

 
conn.close()

Table created

In [3]:
import sqlite3

 
X = sqlite3.connect('NeDB.db')
 
Y = X.cursor()

 
Y.execute('''CREATE TABLE Employee(date text, First_Name text, Last_Name text, Age real)''')

 
Y.execute("INSERT INTO Employee VALUES ('2020-01-01','John','Adam',32)")
 
X.commit()

Y.close()

In [5]:
import sqlite3

 
X = sqlite3.connect('NeDB1.db')
 
Y = X.cursor()

 
Y.execute('''CREATE TABLE Employee(date text, First_Name text, Last_Name text, Age real)''')

 
Y.execute("INSERT INTO Employee VALUES ('2020-01-01','John','Adam',32),('2020-01-01','Mike','Joseph',30),('2020-01-01','Ann','Maria',32);")

 
X.commit()

Y.close()

In [7]:
import sqlite3
 
conn = sqlite3.connect('NewDB.db')

 
cursor = conn.cursor()

 
table ="""CREATE TABLE STUDENT(NAME VARCHAR(255), CLASS VARCHAR(255), SECTION VARCHAR(255));"""
cursor.execute(table)

students = [('John', '8', 'A'),
   ('Adam', '8', 'B'),
   ('Ann', '10', 'A'),
]

cursor.executemany('INSERT INTO STUDENT VALUES (?,?,?)', students)

print("Data Inserted in the table: ")
data=cursor.execute('''SELECT * FROM STUDENT''')
for row in data:
	print(row)


conn.commit()

conn.close()

Data Inserted in the table:
('John', '8', 'A')
('Adam', '8', 'B')
('Ann', '10', 'A')

In [9]:
import sqlite3
 
conn = sqlite3.connect('NewDB2.db')

 
cursor = conn.cursor()

 
table ="""CREATE TABLE STUDENT(NAME VARCHAR(255), CLASS VARCHAR(255), SECTION VARCHAR(255));"""
cursor.execute(table)


cursor.execute('''INSERT INTO STUDENT VALUES ('John', '8', 'A')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Adam', '8', 'B')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Ann', '10', 'A')''')


print("Data Inserted in the table: ")
data=cursor.execute('''SELECT * FROM STUDENT''')
for row in data:
	print(row)


conn.commit()

conn.close()

Data Inserted in the table:
('John', '8', 'A')
('Adam', '8', 'B')
('Ann', '10', 'A')

In [11]:
import sqlite3
 
conn = sqlite3.connect('NewDB3.db')

 
cursor = conn.cursor()

 
table ="""CREATE TABLE STUDENT(NAME VARCHAR(255), CLASS VARCHAR(255), SECTION VARCHAR(255));"""
cursor.execute(table)


cursor.execute('''INSERT INTO STUDENT VALUES ('John', '8', 'A')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Adam', '8', 'B')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Ann', '10', 'A')''')


cursor.execute("SELECT * FROM STUDENT WHERE CLASS = '10'")

print(cursor.fetchall())
  
conn.commit()
conn.close()


conn.close()

[('Ann', '10', 'A')]

In [16]:
import sqlite3
 
conn = sqlite3.connect('NewDB5.db')

 
cursor = conn.cursor()

 
table ="""CREATE TABLE STUDENT(NAME VARCHAR(255), CLASS VARCHAR(255), SECTION VARCHAR(255));"""
cursor.execute(table)


cursor.execute('''INSERT INTO STUDENT VALUES ('John', '8', 'A')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Adam', '8', 'B')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Ann', '10', 'A')''')


cursor.execute("SELECT * FROM STUDENT WHERE NAME Like'A%'")

print(cursor.fetchall())
  
conn.commit()
conn.close()


conn.close()

[('Adam', '8', 'B'), ('Ann', '10', 'A')]

In [18]:
import sqlite3
 
conn = sqlite3.connect('NewDB6.db')

 
cursor = conn.cursor()

 
table ="""CREATE TABLE STUDENT(NAME VARCHAR(255), CLASS VARCHAR(255), SECTION VARCHAR(255));"""
cursor.execute(table)


cursor.execute('''INSERT INTO STUDENT VALUES ('John', '8', 'A')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Adam', '8', 'B')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Ann', '10', 'A')''')


cursor.execute("SELECT * FROM STUDENT ORDER BY NAME")

print(cursor.fetchall())
  
conn.commit()
conn.close()


conn.close()

[('Adam', '8', 'B'), ('Ann', '10', 'A'), ('John', '8', 'A')]

In [20]:
import sqlite3
 
conn = sqlite3.connect('NewDB7.db')

 
cursor = conn.cursor()

 
table ="""CREATE TABLE STUDENT(NAME VARCHAR(255), CLASS VARCHAR(255), SECTION VARCHAR(255));"""
cursor.execute(table)


cursor.execute('''INSERT INTO STUDENT VALUES ('John', '8', 'A')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Adam', '8', 'B')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Ann', '10', 'A')''')


cursor.execute("SELECT * FROM STUDENT ORDER BY NAME DESC")

print(cursor.fetchall())
  
conn.commit()
conn.close()


conn.close()

[('John', '8', 'A'), ('Ann', '10', 'A'), ('Adam', '8', 'B')]

In [22]:
import sqlite3
 
conn = sqlite3.connect('NewDB8.db')

 
cursor = conn.cursor()

 
table ="""CREATE TABLE STUDENT(NAME VARCHAR(255), CLASS VARCHAR(255), SECTION VARCHAR(255));"""
cursor.execute(table)


cursor.execute('''INSERT INTO STUDENT VALUES ('John', '8', 'A')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Adam', '8', 'B')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Ann', '10', 'A')''')


cursor.execute("SELECT NAME, CLASS FROM STUDENT ORDER BY NAME DESC")

print(cursor.fetchall())
  
conn.commit()
conn.close()


conn.close()

[('John', '8'), ('Ann', '10'), ('Adam', '8')]

In [24]:
import pandas as pd
import sqlite3
 
conn = sqlite3.connect('NewDB9.db')




cursor = conn.cursor()

 
table ="""CREATE TABLE STUDENT(NAME VARCHAR(255), CLASS VARCHAR(255), SECTION VARCHAR(255));"""
cursor.execute(table)


cursor.execute('''INSERT INTO STUDENT VALUES ('John', '8', 'A')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Adam', '8', 'B')''')
cursor.execute('''INSERT INTO STUDENT VALUES ('Ann', '10', 'A')''')




print(cursor.fetchall())
  
conn.commit()


df = pd.read_sql("SELECT * FROM STUDENT", con=conn)
print(df)
df.to_csv("Index.csv")

conn.close()

[]
   NAME CLASS SECTION
0  John     8       A
1  Adam     8       B
2   Ann    10       A